1ans:

In [1]:
import pandas as pd

In [2]:
course_name = ['Data Science', 'Machine Learning', 'Big Data', 'Data Engineer']

In [3]:
duration = [2,3,6,4]
df = pd.DataFrame(data = {'course_name' : course_name, 'duration' : duration})

In [4]:
df

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

In [5]:
list(df.iloc[1])

['Machine Learning', 3]

2ans:

In [6]:
df.loc[0:2]

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6

In [7]:
df.iloc[0:2]

        course_name  duration
0      Data Science         2
1  Machine Learning         3

In Pandas, loc and iloc are used to select rows and columns from a DataFrame. The main difference between the two is that loc is label-based, whereas iloc is integer position-based.

3ans:

In [8]:
new_df=df.reindex([3,0,1,2])

In [9]:
new_df

        course_name  duration
3     Data Engineer         4
0      Data Science         2
1  Machine Learning         3
2          Big Data         6

In [10]:
new_df.loc[2]

course_name    Big Data
duration              6
Name: 2, dtype: object

In [11]:
new_df.iloc[2]

course_name    Machine Learning
duration                      3
Name: 1, dtype: object

There is a difference in two outputs because loc gives the row of provided location and iloc gives the row of index provided

4ans:

In [12]:
import pandas as pd
import numpy as np
columns = ['column_1', 'column_2', 'column_3', 'column_4', 'column_5', 'column_6']
indices = [1,2,3,4,5,6]
#Creating a dataframe:
df1 = pd.DataFrame(np.random.rand(6,6), columns = columns, index = indices)

In [13]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.820927  0.256445  0.852625  0.464386  0.217866  0.986737
2  0.463277  0.102299  0.626892  0.508618  0.796274  0.276847
3  0.181383  0.057637  0.032070  0.139674  0.690174  0.178777
4  0.627184  0.738690  0.575918  0.579328  0.202036  0.680263
5  0.614009  0.606012  0.066074  0.909243  0.571395  0.397195
6  0.250661  0.384307  0.814825  0.617324  0.253209  0.423585

In [14]:
df1.mean()

column_1    0.492907
column_2    0.357565
column_3    0.494734
column_4    0.536429
column_5    0.455159
column_6    0.490567
dtype: float64

In [15]:
df1['column_2'].std()

0.2731447837155323

ans5:

In [16]:
df1.loc[:,'column_2']='String'

In [17]:
df1

   column_1 column_2  column_3  column_4  column_5  column_6
1  0.820927   String  0.852625  0.464386  0.217866  0.986737
2  0.463277   String  0.626892  0.508618  0.796274  0.276847
3  0.181383   String  0.032070  0.139674  0.690174  0.178777
4  0.627184   String  0.575918  0.579328  0.202036  0.680263
5  0.614009   String  0.066074  0.909243  0.571395  0.397195
6  0.250661   String  0.814825  0.617324  0.253209  0.423585

In [18]:
df1['column_2'].mean()

TypeError: Could not convert StringStringStringStringStringString to numeric

Because the mean method is to be applied only on numeric data not on strings

ans6:

In pandas, a window function is a way to perform calculations on a specific subset of data, which is defined as a "window" of rows. These calculations are applied to each row of the window, producing a new value for that row based on the values in the window.

Window functions in pandas are divided into two main categories: rolling and expanding.

1.Rolling window functions:

These functions compute a statistic over a rolling window of a fixed size. The size of the window is specified by the window parameter.

2.Expanding window functions:

These functions compute a statistic over an expanding window that includes all rows up to and including the current row.

ans7:

In [21]:
from datetime import date

In [22]:
date.today().year

2023

In [23]:
date.today().month

3

ans8:

In [24]:
def diffdate(d1,d2):
    time1 = pd.Timedelta(days =d1.day , hours = d1.hour , minutes = d1.minute)
    time2 = pd.Timedelta(days =d2.day , hours = d2.hour , minutes = d2.minute)
    print(abs(time2-time1))

In [25]:
d1=input("enter the first date YYYY-MM-DD")
d2=input("enter the first date in YYYY-MM-DD")
diffdate(pd.to_datetime(d1), pd.to_datetime(d2))

enter the first date YYYY-MM-DD 2003-05-02
enter the first date in YYYY-MM-DD 2002-06-7

5 days 00:00:00

ans9:

In [26]:
def cato(fp,col,order):
    data=pd.read_csv(fp)
    cate=data[col]
    cat=pd.Categorical(cate)
    flag=True
    if(order=='decending'):
        flag=False
    cat.sort_values(ascending=flag)

In [ ]:
fp=input("enter the file path")
col=input('enter th column')
order=input('enter ascending or decending order')

cato(fp,col,order)

ans10:

In [ ]:
import pandas as pd
import matplotlib.pyplot as plt


file_path = input("Enter the file path for the sales data CSV file: ")

df = pd.read_csv(file_path)

df['Date'] = pd.to_datetime(df['Date'])

df.set_index('Date', inplace=True)

df.plot(kind='bar', stacked=True)

plt.title('Sales Data by Product Category')
plt.xlabel('Date')
plt.ylabel('Sales')

plt.show()

ans11:

In [28]:
index=[1,2,3,4,5,6,7,8,9,10]
data=[85,90,80,75,85,82,78,85,90,85]

In [29]:
data=pd.DataFrame({'Student_ID':index,'Test_Score':data},)

In [30]:
data

   Student_ID  Test_Score
0           1          85
1           2          90
2           3          80
3           4          75
4           5          85
5           6          82
6           7          78
7           8          85
8           9          90
9          10          85